Revit 2026 API

# PolyLineGetCoordinate Method

---

Gets the coordinate point of the specified index.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetCoordinate(
	int index
)
```
```vb
Public Function GetCoordinate (
	index As Integer
) As XYZ
```
```cpp
public:
XYZ^ GetCoordinate(
	int index
)
```
```fsharp
member GetCoordinate :
        index : int -> XYZ
```

#### Parameters

index Int32
    The index of the coordinates.

#### Return Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the index value is out of range. |

#### Reference

PolyLine Class

Autodesk.Revit.DB Namespace